In [19]:
import pandas as pd
a=["anila",54]
mylist=pd.Series(a)
mylist

0    anila
1       54
dtype: object

In [17]:
import pandas as pd
anila=["noni",28,"panikka veettil kuttiyil"]
mydetails=pd.Series(anila)
mydetails

0                        noni
1                          28
2    panikka veettil kuttiyil
dtype: object

In [23]:
# CREATE LABELS
# -------------------------------


import pandas as pd
a=[1,7,2]
myvar=pd.Series(a,index=["x","y","z"])
myvar

x    1
y    7
z    2
dtype: int64

In [35]:
import pandas as pd
noni=[20,520,895,145,"apple","banana"]
mylist=pd.Series(noni,index=["m","n","o","p","q","r"])
mylist

m        20
n       520
o       895
p       145
q     apple
r    banana
dtype: object

In [41]:
# DATA FRAMES
# -------------------



import pandas as pd
data={
    "calories":[420,300,390],
    "duration":[50,40,45]
}
myvar=pd.DataFrame(data)
myvar

   calories  duration
0       420        50
1       300        40
2       390        45

In [45]:
import pandas as pd
data={
    "name":["anila","akhila","renu","revu"],
    "age":[28,32,28,32]
}
mydetails=pd.DataFrame(data)
mydetails

     name  age
0   anila   28
1  akhila   32
2    renu   28
3    revu   32

In [51]:
# LOCATE ROW
# --------------------
import pandas as pd
data={
    "name":["anila","akhila","renu","revu"],
    "age":[28,32,28,32]
}
mydetails=pd.DataFrame(data)
mydetails.loc[2]

name    renu
age       28
Name: 2, dtype: object

In [63]:
import pandas as pd
df = pd.read_csv('mol.csv')
df

,Date,Product_Category,Price,Discount,Customer_Segment,Marketing_Spend,Units_Sold
0,01-01-2023,Sports,932.80,35.82,Occasional,6780.38,32
1,02-01-2023,Toys,569.48,3.60,Premium,6807.56,16
2,03-01-2023,Home Decor,699.68,3.56,Premium,3793.91,27
3,04-01-2023,Toys,923.27,0.61,Premium,9422.75,29
4,05-01-2023,Toys,710.17,47.83,Premium,1756.83,17
...,...,...,...,...,...,...,...
995,22-09-2025,Fashion,740.06,49.06,Regular,1890.83,34
996,23-09-2025,Electronics,517.10,28.48,Premium,8011.66,21
997,24-09-2025,Electronics,683.43,12.98,Occasional,3408.51,19
998,25-09-2025,Sports,51.26,21.85,Occasional,7335.62,26
999,26-09-2025,Home Decor,93.94,29.68,Regular,4258.11,39